Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [ ]:
import pandas as pd

In [6]:
ds1 = pd.Series([4,8,15,16,23,42])

print(ds1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [17]:
x = pd.Series(['password', 'id', 'name' , 'no' , 'address'])

In [18]:
print(x)

0    password
1          id
2        name
3          no
4     address
dtype: object

In [21]:
k = {"name" : ['Alice', 'Bob', 'Claire'] ,
    "age ": [25 , 30 , 27] ,
    "gender" :[ "female" , "male" ,"female"]}

In [24]:
df = pd.DataFrame(k)

In [25]:
df

     name  age   gender
0   Alice    25  female
1     Bob    30    male
2  Claire    27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A single-column DataFrame, an index can be optional, but a Series has to have an index defined

A single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [27]:
data = [1000, 2000, 3000, 4000, 5000]
s = pd.Series(data)

In [28]:
print(s)

0    1000
1    2000
2    3000
3    4000
4    5000
dtype: int64

In [29]:
data = [1000, 2000, 3000, 4000, 5000]
df = pd.DataFrame(data, columns=['Column1'])

In [30]:
df

   Column1
0     1000
1     2000
2     3000
3     4000
4     5000

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Head  , Tail ,Describe ,drop ,loc

In [47]:
df.head()

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000

In [48]:
df.tail()

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000

In [49]:
df.describe()

                  1            2
count      3.000000     3.000000
mean   23333.333333  1433.333333
std     1527.525232   750.555350
min    22000.000000  1000.000000
25%    22500.000000  1000.000000
50%    23000.000000  1000.000000
75%    24000.000000  1650.000000
max    25000.000000  2300.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [50]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

In [51]:
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000